### DS102 | In Class Practice Week 1B - Pandas & Numpy I
<hr>
## Learning Objectives
At the end of the lesson, you will be able to:

- read a CSV file into a `DataFrame` with default `sep` parameters as separators

- find out key properties (`shape`, `columns`, `dtypes`) of a `DataFrame`.

- Use `head()` and `sample()` to look at a subset of the dataset


- retrieve a row from a `DataFrame` using indices and `.iloc`

- retrieve a column from a `DataFrame`, recognising this gives a `Series` 


- filter data using numeric comparators e.g. `>=1000`

- filter data using string equality comparators e.g. `== 'RED'`

- filter data using multiple conditions using `.isin()` e.g. `.isin([1, 2, 3])`

- filter data using two conditions, using the AND clause


### Datasets Required for this In Class
1. `employees-1k.csv`

#### Import `pandas` and `numpy`

In [1]:
import pandas as pd
import numpy as np

### Instantiate a `DataFrame`

**Instantiate a `DataFrame` from an external CSV file**
To manipulate data as a `DataFrame`, use `pd.read_csv()` to read the CSV file into a `DataFrame`. Refer to the documentation [here](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html#pandas.read_csv).

In [4]:
# Read from CSV file
df = pd.read_csv('employees-1k.csv')

Find out the no. of rows and columns using `df.shape`

In [6]:
# Find no. of rows and columns
df.shape

(1000, 4)

Check the columns in the `DataFrame` using `df.dtypes` and `df.columns`

In [14]:
# Check the columns using dtypes
df.dtypes

employee_id         int64
annual_inc        float64
employee_title     object
home_ownership     object
dtype: object

In [15]:
# Check the columns using columns
df.columns

Index(['employee_id', 'annual_inc', 'employee_title', 'home_ownership'], dtype='object')

Find out what's in the dataset using `head()` or `sample()`. `head()` will show the first 5 records by default, while `sample()` will randomly select and show 1 record by default.

In [16]:
# Find the first few records with .head()
df.head()

   employee_id  annual_inc                employee_title home_ownership
0     44037036     55000.0            Account Specialist            OWN
1     41036228    184000.0                  IT Architect       MORTGAGE
2     67601397     30000.0                 night auditor           RENT
3     64972576     72000.0  Field Service Representative       MORTGAGE
4     59922079     84000.0                 Senior Pastor       MORTGAGE

In [23]:
# Randomly sample (without replacement) with .sample()
df.sample()

     employee_id  annual_inc employee_title home_ownership
718     67409994     33000.0            NaN       MORTGAGE

### Retrieve records & columns from a `DataFrame`

#### Retrieve a column from a `DataFrame`
We will now retrieve all the `annual_inc` data from the `df`. Use the column name to retrieve the column and store that as a new variable `annual_incs`. This is known as a `Series`. 
<div class="alert alert-info">
<b>DS102 Learning Guidelines: </b>For DS102, only store <u>1 column</u> in a `Series`. Refer to [the documentation](https://pandas.pydata.org/pandas-docs/stable/advanced.html) for other ways a `Series` can be represented.
</div>

In [28]:
#Retrieve a series from a dataframe and verify that the datatype is a Series

annual_inc = df['annual_inc']

0     55000.0
1    184000.0
2     30000.0
3     72000.0
4     84000.0
Name: annual_inc, dtype: float64

In [31]:
# Use Series.head() to show the first records
annual_inc.head(n=5)

0     55000.0
1    184000.0
2     30000.0
3     72000.0
4     84000.0
Name: annual_inc, dtype: float64

In [30]:
# Use Series.sample() to sample records from the Series
# (Note the indices of the Series. They are random.)
annual_inc.sample()

989    57600.0
Name: annual_inc, dtype: float64

In [32]:
# Verify that the datatype is a Series
type(annual_inc)

pandas.core.series.Series

#### Retrieve a record from a `DataFrame`
To retrieve just 1 record from the `DataFrame`, use `.iloc` and specify the index of the record. Put this value in the square brackets `[]`.

Note: When you do this, the datatype of the result is a `Series`. Use the index in the `Series` to retrieve the value.

In [36]:
# Exercise: How do you show the first 5 records of the df?
df.iloc[:5]

   employee_id  annual_inc                employee_title home_ownership
0     44037036     55000.0            Account Specialist            OWN
1     41036228    184000.0                  IT Architect       MORTGAGE
2     67601397     30000.0                 night auditor           RENT
3     64972576     72000.0  Field Service Representative       MORTGAGE
4     59922079     84000.0                 Senior Pastor       MORTGAGE

In [38]:
# Retrieve the second record from the df using .iloc[] and validate the result. 
# Store this in a variable called row_2
row2 = df.iloc[1]

print(row2)

employee_id           41036228
annual_inc              184000
employee_title    IT Architect
home_ownership        MORTGAGE
Name: 1, dtype: object

In [39]:
# Verify that the datatype is a Series, where the index are now the column names
type(row2)

pandas.core.series.Series

In [44]:
# Complete the following code to retrieve the employee_id and employee_title.
emp_id = 44037036

emp_title = df[(df['employee_id'] == emp_id)]['employee_title'].values[0]

# Then, fill in the blanks in the following statement.
print('The employee with ID ' + str(emp_id) + ' has the job title ' + emp_title + '.')

The employee with ID 44037036 has the job title Account Specialist.

In [76]:
# Your turn: What is the employee ID and annual income of the 10th employee (index=9)
# Write your code here

row9 = df.iloc[9]
emp_9id = row9['employee_id']
emp_9annual_inc= row9['annual_inc']
# Then, fill in the blanks in the following statement. Debug the code by 
# specifying the correct datatypes of the variables.
print('The employee with ID ' + str(emp_9id) + ' has an annual income of ' + str(emp_9annual_inc) + '.')

The employee with ID 22974788 has an annual income of 190000.0.

### Filter records from a `DataFrame`

#### Filtering by one condition, numeric

To perform filtering by numeric values, first **check that the column is a numeric column (`int64` or `float64`)**. It was already done when you used `df.dtypes`. Then, use the following signature to do so:
```python
df[df['column'] <conditional operator> <value>]
```
Take note of the open & close square brackets, and how a condition is expressed, where you use a **column name**, a **conditional operator** and a **value**.

In [78]:
# Before filtering, it is a good practice to use copy() first. This is done
# so modifications do not get reflected in the original df
df_above_300k = df.copy()

# Q. Identify all records in the df where the annual_inc is 300000 or greater.
df_above_300k[(df_above_300k['annual_inc']) >= 300000]

     employee_id  annual_inc           employee_title home_ownership
127     31127612    500000.0                      CEO       MORTGAGE
627     35843557    345000.0                 Director       MORTGAGE
657      4629113    340000.0                Citigroup           RENT
695      7757331    600000.0          Kildare Capital           RENT
843     65509222    325000.0  Global solutions leader       MORTGAGE
863     49282491    500000.0           Vice President           RENT
946     57415353    310000.0    Senior Vice President           RENT

#### Filtering by one condition, using string comparators

To perform filtering using a string function, use `==` e.g. `== 'OWN'`. Follow the above notation using a column, a comparator and a value in the same order.

In [79]:
# Copy the df
df_home_ownership_own = df.copy()

# Filter for all records where homeownership has the value 'OWN'
df_above_300k[(df_above_300k['home_ownership']) == 'OWN']

     employee_id  annual_inc                     employee_title home_ownership
0       44037036    55000.00                 Account Specialist            OWN
19      35845083    45000.00                             claims            OWN
25      34691613    50000.00                        General mgr            OWN
32      36665106    73000.00                      VP Operations            OWN
43      10018508    75000.00                     Police Officer            OWN
57      29242569    30000.00                   IT Adminjstrator            OWN
66        899241   153000.00            united states air force            OWN
82      42134060    55000.00      Career and Tech Ed Specialist            OWN
97      21047758    98000.00           Assistant Vice President            OWN
106      9111888    90000.00                        EQ Mechanic            OWN
108     72549688    65000.00                               Chef            OWN
110      1448392    72000.00                                HRA            OWN
113     69192617    65000.00                         P&D DRIVER            OWN
117     66752505    39000.00                     Office Manager            OWN
120     49664280    30000.00                             Teller            OWN
121     23071512    60000.00              production department            OWN
126     21860210    78800.00         Manager, Benefits Services            OWN
128       411839    61200.00        Halliburton Energy Services            OWN
131      6508818    52000.00           County of San Bernardino            OWN
139     59044750    30000.00                           Rig Hand            OWN
140     70368683   106000.00                solution architect             OWN
150     66075587    65000.00                   product Manager             OWN
159     13697027    15600.00                                NaN            OWN
174     38358826    72750.00        IT Service Delivery Manager            OWN
180     46446143    68000.00                       Sales Manaer            OWN
182      9307893    43000.00                                NaN            OWN
200     25325650    36000.00              home health assistant            OWN
208     54916455    45337.00                                NaN            OWN
210     73375122   200000.00                              buyer            OWN
236     33589136    49800.00                           Designer            OWN
..           ...         ...                                ...            ...
724     32718328    84200.00        International Sales Manager            OWN
733     42535707   113000.00   DIRECTOR, INFORMATION TECHNOLOGY            OWN
737     64382855    75000.00                  CHEMICAL OPERATOR            OWN
763     49931387    28000.00                              Clerk            OWN
772      1660836    58000.00        Shuman McCuskey Slicer PLLC            OWN
778      6332201    60000.00                        TYK AMERICA            OWN
795      5547044    60000.00      Sovran Acquisition/Uncle bobs            OWN
817     55476671    17000.00                          Caregiver            OWN
829     71308030   105000.00  Aviation Business Process Manager            OWN
844     64383454    90000.00                         Superviser            OWN
848     65500329    40000.00                           Assembly            OWN
849     43847103   104000.00                         Contractor            OWN
854      9028883    35351.28                Ft. Elliot C.I.S.D.            OWN
885     59714246    46000.00                     Office Manager            OWN
893     63117781    87300.00                 Purchasing Manager            OWN
901     55247730    66161.00                      rural carrier            OWN
902     69495774   135000.00                 Equipment operator            OWN
908     71318221   125000.00                   Talent Recruiter            OWN
915     59672185    19641.00                               cook            OWN
918     71319000    70000.00                 Software Developer            OWN
929     60897058    90000.00          SR. Mechanical Technician            OWN
930      8997492    60000.00                        maintenance            OWN
932     48034499    55000.00                    benefit advisor            OWN
933     62553089    48000.00                            Teacher            OWN
943     68340057   114900.00                            analyst            OWN
947     59582209    36000.00  Adjunct Professor \ Administrator            OWN
954     54259265    73000.00           Administrative Assistant            OWN
963     13667253    52178.00                 Sr. Adm. Secretary            OWN
968     71340592    25000.00                      Truck Driver             OWN
976     57779211   185000.00                Legal Administrator            OWN

[110 rows x 4 columns]

You can find records satisfying multiple string matches with the `isin` function. First state the **column** you would want to filter on. Then, like calling a function, use a `.` symbol followed by `.isin()`. Finally, put the values of interest **as a list**. Put this list as a parameter of the `isin()` function.

In [92]:
# Copy the df
df_employee_title = df.copy()

# Filter for al records where employee_title is 'Accountant' or 'Sales'
df_employee_title[df_employee_title['employee_title'].isin({'Accountant','Sales'})]

     employee_id  annual_inc employee_title home_ownership
93      70641473    100000.0          Sales       MORTGAGE
98      65559791     85000.0          Sales       MORTGAGE
170     63773407     55000.0          Sales       MORTGAGE
247     47357024     55000.0          Sales           RENT
485     35924591    130000.0          Sales       MORTGAGE
582     19867982     62000.0          Sales           RENT
807     31726709     85000.0     Accountant           RENT
811     67688327     72000.0          Sales       MORTGAGE
839     63613406     60000.0     Accountant           RENT
913     70334794    120000.0          Sales           RENT
982     13937604     44500.0     Accountant       MORTGAGE

#### Filtering by two conditions using the AND logic

If you would like to filter for two conditions, using `AND` as the logical operator, put a `&` in your expression. For every condition, surround them with round brackets `(` and `)`.

In [94]:
# Copy the df
df_of_interest = df.copy()

# Filter for all records where the employee_title is President and the annual_inc is 225000 or greater

df_of_interest[(df_of_interest['employee_title'] == 'President') & 
               (df_of_interest['annual_inc'] >= 225000)]

     employee_id  annual_inc employee_title home_ownership
238       370086    250000.0      President       MORTGAGE

In [95]:
# Contrast this with the following filter:
# Q. Find all employees with the title 'President'
# Your turn: Can you solve this in-class exercise?
df_employee_pres = df.copy()

df_employee_pres[df_employee_pres['employee_title'].isin({'President'})]

     employee_id  annual_inc employee_title home_ownership
7       37075903    108000.0      President           RENT
72      64555876    100000.0      President       MORTGAGE
238       370086    250000.0      President       MORTGAGE
293     23052676    100000.0      President           RENT
515     66185317     80000.0      President            OWN
775     11217187     72000.0      President           RENT

In [98]:
# Contrast this with the following filter:
# Q. Find all employees who have an annual_inc of 225000 or more.
# Your turn: Can you solve this in-class exercise?
df_annual_inc = df.copy()

df_annual_inc[(df_annual_inc['annual_inc'] >= 225000)]

     employee_id  annual_inc            employee_title home_ownership
116     41302339    235000.0           Account Manager       MORTGAGE
127     31127612    500000.0                       CEO       MORTGAGE
238       370086    250000.0                 President       MORTGAGE
338     43848504    248000.0                    Editor           RENT
370     68317904    250000.0          Speech Therapist       MORTGAGE
411     31706813    260000.0                   Advisor       MORTGAGE
505     42454613    250000.0  Chief Technology Officer       MORTGAGE
627     35843557    345000.0                  Director       MORTGAGE
657      4629113    340000.0                 Citigroup           RENT
695      7757331    600000.0           Kildare Capital           RENT
843     65509222    325000.0   Global solutions leader       MORTGAGE
855     65651843    225000.0                   Dentist           RENT
863     49282491    500000.0            Vice President           RENT
873      8332071    265000.0             Cisco Systems           RENT
946     57415353    310000.0     Senior Vice President           RENT
950      4026946    275000.0       Sheridan healthcare       MORTGAGE
955     54259311    225000.0                       CEO       MORTGAGE

**Credits**
- [Lending Club Loan Data, Kaggle](https://www.kaggle.com/wendykan/lending-club-loan-data) for the dataset
<hr>
`HWA-DS102-INCLASS-1B-201810`